import { Recipe } from '/@/types/types'

const recipes: Recipe[] = [
  {
    title: 'קרם וניל למילוי עוגות',
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '2 שמנת מתוקה',
          '4 כפות סוכר',
          '2 סוכר וניל',
          '1.5 כוסות חלב',
          '1 אינסטנט פודינג וניל'
        ]
      }
    ],
    steps: ['להקציף הכל יחד.'],
    notes: 'מעולה.'
  },
  {
    title: `ספינג'ים`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '1 ק"ג קמח',
          '30 גרם שמרים',
          'קורט מלח',
          '4 כפות סוכר',
          '4 כוסות מים פושרים',
          '1 ביצה',
          'שמן לטיגון עמוק'
        ]
      },
      {
        title: 'לסירופ',
        ingredients: ['3 כוסות סוכר', '2 כוסות מים', 'מיץ מלימון אחד']
      }
    ],
    steps: [
      'מערבבים את כל חומרי הבצק (שמרים יבשים יש להתפיח קודם, שמרים לחים - מוסיפים ישירות). לשים היטב עד שמתקבל בצק רך ודביק (אם חסר מים מוסיפים קצת מים פושרים).',
      'מתפיחים כשעה - קערה עטופה בנייר ניילון נצמד, ומגבת.',
      'כעבור שעה לשים את הבצק, ומתפיחים חצי שעה נוספת.',
      'מרתיחים שמן בסיר עמוק, בוצעים פיסות קטנות מן הבצק ומטגנים משני הצדדים.',
      "ממיסים את חומרי הסירופ בסיר, טובלים את הספינג'ים המוכנים, ומגישים."
    ],
    notes: 'במקום סירופ אפשר לבזוק אבקת סוכר.'
  },
  {
    title: `עוגיות שוקולד צ'יפס`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          `125 ג' חמאה מרוככת`,
          `1 כוס סוכר`,
          '1/2 כפית תמצית וניל',
          '1 ביצה טרופה',
          '1 3/4 כוסות קמח תופח',
          '150 גרם שבבי שוקולד'
        ]
      }
    ],
    steps: [
      `מקציפים חמאה + סוכר + תמצית וניל, מוסיפים בהדרגה את הביצה תוך הקצפה, ובסוף מוסיפים את הקמח.`,
      `מערבבים הכל לתערובת אחידה, מוסיפים את השוקולד ושוב מערבבים.`,
      'מכניסים לחצי שעה במקרר.',
      'יוצרים כדורים קטנים ואופים ב-180 מעלות עד השחמה.'
    ]
  },
  {
    title: `עוגיות טחינה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: ['3 כוסות קמח', `200 ג' חמאה`, 'כוס סוכר', 'כוס טחינה גולמית', '1 סוכר וניל']
      }
    ],
    steps: [
      'לערבב הכל, עיגולים על תבנית - לשים מעל כל עוגיה סוכר וקצת שקדים פרוסים (או אגוזים או מה שבא לי).',
      'אופים על 170 מעלות ל-15 דקות.',
      'אחרי האפייה מקררים את העוגיות ורק אז מוציאים אותן, כדי שלא יתפרקו.'
    ]
  },
  {
    title: `עוגת דבש`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '5 ביצים מופרדות',
          'כוס סוכר',
          '1 כוס שמן',
          '1/2 כוס דבש',
          '1/3 כוס מייפל',
          '1 שמנת מתוקה',
          '2 כוסות קמח תופח',
          '1 כפית קינמון',
          '1/2 כפית סודה לשתייה'
        ]
      },
      {
        title: 'סירופ',
        ingredients: ['1/2 כוס מים', '1/3 כוס סוכר', '1/3 כוס מייפל']
      }
    ],
    steps: [
      'מקציפים 5 חלבונים עם כוס סוכר לקצפת יציבה.',
      'לערבב את שאר החומרים ביחד (קודם יבשים ורטובים ואח"כ לאחד), ולהוסיף להם את תערובת הקצפת.',
      'להכניס לתבנית (אינגליש קייק זה טוב), 150 מעלות במשך 45 דקות.',
      'להרתיח את חומרי הסירופ, ולשפוך בעדינות על העוגה המוכנה בצורה אחידה.'
    ]
  },
  {
    title: `עוגת גבינה אפויה (אלינור)`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '6 ביצים',
          'כוס סוכר',
          '750 גרם גבינה לבנה',
          'גביע וחצי שמנת חמוצה',
          '3 כפות אינסטנט פודינג וניל',
          '2 כפות קמח תופח',
          '1 כף קורנפלור',
          'קליפת לימון מגוררת',
          '1 סוכר וניל'
        ]
      }
    ],
    steps: [
      'מפרידים את הביצים, ומקציפים את החלבון עם הסוכר לקצף קשה ויציב.',
      'את שאר החומרים מערבבים יחד, ובסוף מקפלים את תערובת הקצף לתערובת השנייה עד אחידות.',
      'בתנור, 180 מעלות, עד שזה נראה טוב!'
    ],
    notes: 'לא מומלץ לאכול את זה היישר מן התנור, יש לחכות עד התייצבות ☺'
  },
  {
    title: `יחידות שוקולד קטנות (אלינור)`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '350 גרם שוקולד מריר',
          '50 גרם חמאה',
          '3 ביצים',
          '1/2 כוס סוכר',
          '3/4 כוס קמח תופח',
          '1 כף ליקר (תפוזים)',
          '1 כף תמצית וניל'
        ]
      }
    ],
    steps: [
      'ממיסים שוקולד לחמאה.',
      'מקציפים ביצים וסוכר.',
      'מוסיפים את תערובת השוקולד אל מקצפת הביצים והסוכר בקיפול, ולאחר מכן מוסיפים בקיפול את הקמח.',
      'לבסוף, מוסיפים את הליקר והוניל.',
      "שמים את התערובת שעה במקרר לפחות, להתייצבות התערובת, ולאחר מכן מחלקים למנג'טים קטנים (או לתבנית שקעים פצפונים), 170-180 מעלות בתנור, בסביבות 10-15 דקות.",
      'נא להשגיח.'
    ]
  },
  {
    title: `פוקצ'ה`,
    ingredients: [
      {
        title: 'חומרים לבצק',
        ingredients: [
          '5 כוסות קמח',
          '50 גרם שמרים טריים (גרגרים)',
          '1 1/4 כפית מלח',
          '1 1/4 כפית סוכר',
          '2 1/2 כפות עשבי תיבול קצוצים',
          '5 כפות שמן זית',
          '1 1/2 מים פושרים'
        ]
      }
    ],
    steps: [
      'שמים בקערה את הקמח (המנופה) עם המלח והסוכר ומערבבים.',
      'מוסיפים את כל החומרים חוץ מהמים, ומערבבים. יוצקים את המים בהדרגה עד לקבלת בצק אחיד. לשים את הבצק בין 5-7 דקות (בידיים!).',
      'מתפיחים במקום חמים כשעה, לשים שוב.',
      "מתפיחים שנית במשך כשעה, ולאחר מכן אפשר לרדד מעט, ויוצרים את הצורה הרצויה (אפשר לעשות אליפסות ארוכות, אפשר לעשות עיגולים קטנים, אפשר גם פוק'צה אחת עצומה).",
      'מעבירים לתבנית מקומחת. מורחים שמן זית על הבצק ומפזרים מעט מלח גס. מתפיחים חצי שעה נוספת.',
      "עכשיו אפשר לשים מעל מה שבא לנו - פרוסות עגבניה, חציל, פלפל, בצל (מטוגן או לא), זיתים... שמים בתנור על 200 מעלות עד הזהבה (משהו כמו 20 דקות). רצוי להגיש עם מטבלים שונים (שמנת, פסטו, זיתים וכו'...)."
    ],
    notes: '- יאמי -'
  },
  {
    title: `עוגת וניל פשוטה ונחמדה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          'כוס סוכר',
          '200 גרם חמאה',
          '2 כפיות תמצית וניל',
          '3 ביצים',
          '200 מ"ל יוגורט (אפשר יוגורט וניל)',
          '380 גרם קמח תופח'
        ]
      }
    ],
    steps: [
      'מקציפים 10 דקות את הסוכר, החמאה והוניל.',
      'מוסיפים את הביצים, אחת אחת - לא מוסיפים ביצה נוספת עד שהקודמת לא נבלעה לחלוטין.',
      'מוסיפים את היוגורט בזרם דק. מקציפים עוד דקה, מכבים את המיקסר.',
      'מוסיפים את הקמח ומקפלים עם מרית עד אחדות (לא יותר מדי).',
      'בשתי תבניות אינגליש קייק משומנות, 25-30 דקות ב-180 מעלות.'
    ]
  },
  {
    title: `ריבה של סבתא תמרה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '1 ק"ג פרי חתוך לקוביות קטנות (עדיפות לפירות רכים...)',
          '1/2 ק"ג סוכר',
          '2 כפות פודינג (עדיף וניל, אבל אפשר גם שוקולד)',
          '1/2 כף קינמון',
          'כף וחצי מיץ לימון (סחוט טרי)'
        ]
      }
    ],
    steps: [
      'שמים את הפרי החתוך והמוכן עם הסוכר בסיר, ומבשלים על אש בינונית עד קטנה במשך כ-3/4 שעה. נא להקפיד על ערבוב מדי כמה דקות.',
      'מערבבים בצלוחית קטנה את הפודינג, הקינמון והמיץ לימון, ומוסיפים לסיר.',
      'ממשיכים לבשל עוד כרבע שעה, ומסירים מהאש.'
    ],
    notes: 'יש להקפיד לערבב גם לאחר כיבוי הלהבה, למען מניעת גושים.'
  },
  {
    title: `עוגת שבבי שוקולד`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '100 גרם חמאה רכה',
          '1 כוס סוכר',
          '2 ביצים',
          '2 כוסות קמח',
          '2 כפיות אבקת אפיה',
          '1/2 כפית סודה לשתיה',
          '1 גביע שמנת גדול, או שניים קטנים => 150 מ"ל.'
        ]
      },
      {
        title: 'לערבב בצד',
        ingredients: ['רבע כוס סוכר חום', '1 כפית קינמון', '150 גרם שבבי שוקולד']
      }
    ],
    steps: [
      'מחממים תנור ל-180 מעלות.',
      'מערבבים חומרים רטובים ויבשים בנפרד.',
      'מאחדים תערובות, ומוסיפים את השוקולד - לא לערבב יותר מדי.',
      "משהו כמו 40 ד' בתנור, לא על טורבו."
    ],
    notes:
      'אה! לפני שמכניסים לתנור בשתי תבניות אינגליש קייק, שמים כף רוטב מייפל על כל עוגה (ואז לתנור!)'
  },
  {
    title: `עוגת גבינה וצימוקים, לשבועות`,
    ingredients: [
      {
        title: 'חומרים לבסיס',
        ingredients: [
          '200 גרם ביסקוויטים, מרוסקים',
          '100 גרם חמאה, מומסת',
          'קורט קינמון טחון',
          '100 גרם צימוקים'
        ]
      },
      {
        title: 'למלית',
        ingredients: [
          '3 גביעי גבינה לבנה 9% (750 גרם)',
          '1 כוס סוכר',
          '1 שקית סוכר וניל',
          '6 ביצים, מופרדות לחלמונים ולחלבונים',
          '2 כפות סוכר'
        ]
      },
      {
        title: 'לציפוי',
        ingredients: ['1 גביע שמנת חמוצה', '2 כפות אבקת סוכר']
      },
      {
        title: 'תבנית בקוטר 26 ס"מ, משומנת ומרופדת בנייר אפייה',
        ingredients: []
      }
    ],
    steps: [
      'מחממים תנור לחום בינוני (180 מעלות).',
      'להכנת הבסיס: מערבבים בקערה את פירורי הביסקוויטים, החמאה והקינמון לתערובת אחידה, ושוטחים בתחתית התבנית. מפזרים את הצימוקים על הבסיס.',
      'להכנת המלית: טורפים בקערה את הגבינה, הסוכר, סוכר-הווניל והחלמונים.',
      'שמים בקערת המערבל את החלבונים והסוכר, ומקציפים לקצף נוקשה. מקפלים בעדינות לתערובת הגבינה.',
      'שוטחים את תערובת הגבינה על בסיס הביסקוויטים, ואופים 40-45 דקות.',
      'להכנת הציפוי: טורפים את השמנת עם אבקת הסוכר. מורחים את התערובת על העוגה האפויה ואופים, 2-3 דקות נוספות.'
    ]
  },
  {
    title: `עוגת שוקולד נהדרת, לפסח`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '150 גרם שוקולד מריר, שבור לקוביות',
          '150 גרם חמאה',
          '150 גרם סוכר',
          '6 ביצים, מופרדות לחלמונים ולחלבונים',
          '150 גרם אגוזים, טחונים',
          '1 כף קמח מצה, מנופה'
        ]
      },
      {
        title: 'תבנית בקוטר 24 ס"מ, משומנת ומרופדת בנייר אפייה',
        ingredients: []
      }
    ],
    steps: [
      'מחממים תנור ל-180 מעלות. ממיסים את השוקולד, במיקרוגל או בסיר כפול.',
      'שמים בקערת המערבל את החמאה והסוכר, וטורפים לתערובת קלילה וקצפית. מוסיפים את החלמונים, אחד אחד, וטורפים היטב אחרי כל הוספה.',
      'טורפים פנימה את השוקולד המומס, האגוזים וקמח המצה.',
      'מקציפים את החלבונים לקצף נוקשה, ומקפלים בעדינות לתערובת החמאה.',
      'יוצקים בעדינות לתבנית ואופים כ-45 דקות. מתקבלת עוגה נמוכה. אפשר לצפות בזיגוג שוקולד.'
    ]
  },
  {
    title: `עוגת אגוזים, לפסח`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '6 ביצים',
          '1 כוס סוכר',
          '2 כוסות אגוזים, טחונים',
          '3 כפות קמח מצה, מנופה',
          '1/4 כוס מיץ תפוזים',
          '1 מיכל שמנת לקצפת',
          '2 כפות אבקת סוכר',
          'מעט שוקולד מריר, מגורר'
        ]
      },
      {
        title: 'תבנית בקוטר 26 ס"מ, משומנת',
        ingredients: []
      }
    ],
    steps: [
      'מחממים תנור ל-180 מעלות. מקציפים את הביצים, מוסיפים בהדרגה את הסוכר וממשיכים להקציף לקצף יציב.',
      'מערבבים בקערה את האגוזים וקמח המצה, ומקפלים בעדינות את קצף הביצים. מוסיפים גם את מיץ התפוזים, ומערבבים בעדינות.',
      'שוטחים את הבלילה בתבנית, ואופים כ-20 דקות. מצננים.',
      'מקציפים את השמנת ואבקת הסוכר לקצפת יציבה ומעטרים בה את העוגה. זורים מעל שוקולד מגורר.'
    ]
  },
  {
    title: `פנקייקים`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          'כוס קמח תופח',
          '2 ביצים',
          '1/3 כוס חלב',
          '1 גביע יוגורט',
          'חצי כוס סוכר',
          '3 כפות שמן',
          'תמצית וניל'
        ]
      }
    ],
    steps: ['לערבב חומרים יבשים ורטובים בנפרד, לאחד תערובות ולטגן על אש נמוכה.']
  },
  {
    title: `עוגת גבינה עם ריבת חלב`,
    description: ``,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: []
      }
    ],
    steps: []
  }
]

export default recipes
