import { Recipe } from '/@/types/types'

const recipes: Recipe[] = [
  {
    title: 'קרם וניל למילוי עוגות',
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '2 שמנת מתוקה',
          '4 כפות סוכר',
          '2 סוכר וניל',
          '1.5 כוסות חלב',
          '1 אינסטנט פודינג וניל'
        ]
      }
    ],
    steps: ['להקציף הכל יחד.'],
    notes: 'מעולה.'
  },
  {
    title: `ספינג'ים`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '1 ק"ג קמח',
          '30 גרם שמרים',
          'קורט מלח',
          '4 כפות סוכר',
          '4 כוסות מים פושרים',
          '1 ביצה',
          'שמן לטיגון עמוק'
        ]
      },
      {
        title: 'לסירופ',
        ingredients: ['3 כוסות סוכר', '2 כוסות מים', 'מיץ מלימון אחד']
      }
    ],
    steps: [
      'מערבבים את כל חומרי הבצק (שמרים יבשים יש להתפיח קודם, שמרים לחים - מוסיפים ישירות). לשים היטב עד שמתקבל בצק רך ודביק (אם חסר מים מוסיפים קצת מים פושרים).',
      'מתפיחים כשעה - קערה עטופה בנייר ניילון נצמד, ומגבת.',
      'כעבור שעה לשים את הבצק, ומתפיחים חצי שעה נוספת.',
      'מרתיחים שמן בסיר עמוק, בוצעים פיסות קטנות מן הבצק ומטגנים משני הצדדים.',
      "ממיסים את חומרי הסירופ בסיר, טובלים את הספינג'ים המוכנים, ומגישים."
    ],
    notes: 'במקום סירופ אפשר לבזוק אבקת סוכר.'
  },
  {
    title: `עוגיות שוקולד צ'יפס`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          `125 ג' חמאה מרוככת`,
          `1 כוס סוכר`,
          '1/2 כפית תמצית וניל',
          '1 ביצה טרופה',
          '1 3/4 כוסות קמח תופח',
          '150 גרם שבבי שוקולד'
        ]
      }
    ],
    steps: [
      `מקציפים חמאה + סוכר + תמצית וניל, מוסיפים בהדרגה את הביצה תוך הקצפה, ובסוף מוסיפים את הקמח.`,
      `מערבבים הכל לתערובת אחידה, מוסיפים את השוקולד ושוב מערבבים.`,
      'מכניסים לחצי שעה במקרר.',
      'יוצרים כדורים קטנים ואופים ב-180 מעלות עד השחמה.'
    ]
  },
  {
    title: `עוגיות טחינה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: ['3 כוסות קמח', `200 ג' חמאה`, 'כוס סוכר', 'כוס טחינה גולמית', '1 סוכר וניל']
      }
    ],
    steps: [
      'לערבב הכל, עיגולים על תבנית - לשים מעל כל עוגיה סוכר וקצת שקדים פרוסים (או אגוזים או מה שבא לי).',
      'אופים על 170 מעלות ל-15 דקות.',
      'אחרי האפייה מקררים את העוגיות ורק אז מוציאים אותן, כדי שלא יתפרקו.'
    ]
  },
  {
    title: `עוגת דבש`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '5 ביצים מופרדות',
          'כוס סוכר',
          '1 כוס שמן',
          '1/2 כוס דבש',
          '1/3 כוס מייפל',
          '1 שמנת מתוקה',
          '2 כוסות קמח תופח',
          '1 כפית קינמון',
          '1/2 כפית סודה לשתייה'
        ]
      },
      {
        title: 'סירופ',
        ingredients: ['1/2 כוס מים', '1/3 כוס סוכר', '1/3 כוס מייפל']
      }
    ],
    steps: [
      'מקציפים 5 חלבונים עם כוס סוכר לקצפת יציבה.',
      'לערבב את שאר החומרים ביחד (קודם יבשים ורטובים ואח"כ לאחד), ולהוסיף להם את תערובת הקצפת.',
      'להכניס לתבנית (אינגליש קייק זה טוב), 150 מעלות במשך 45 דקות.',
      'להרתיח את חומרי הסירופ, ולשפוך בעדינות על העוגה המוכנה בצורה אחידה.'
    ]
  },
  {
    title: `עוגת גבינה אפויה (אלינור)`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '6 ביצים',
          'כוס סוכר',
          '750 גרם גבינה לבנה',
          'גביע וחצי שמנת חמוצה',
          '3 כפות אינסטנט פודינג וניל',
          '2 כפות קמח תופח',
          '1 כף קורנפלור',
          'קליפת לימון מגוררת',
          '1 סוכר וניל'
        ]
      }
    ],
    steps: [
      'מפרידים את הביצים, ומקציפים את החלבון עם הסוכר לקצף קשה ויציב.',
      'את שאר החומרים מערבבים יחד, ובסוף מקפלים את תערובת הקצף לתערובת השנייה עד אחידות.',
      'בתנור, 180 מעלות, עד שזה נראה טוב!'
    ],
    notes: 'לא מומלץ לאכול את זה היישר מן התנור, יש לחכות עד התייצבות ☺'
  },
  {
    title: `יחידות שוקולד קטנות (אלינור)`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '350 גרם שוקולד מריר',
          '50 גרם חמאה',
          '3 ביצים',
          '1/2 כוס סוכר',
          '3/4 כוס קמח תופח',
          '1 כף ליקר (תפוזים)',
          '1 כף תמצית וניל'
        ]
      }
    ],
    steps: [
      'ממיסים שוקולד לחמאה.',
      'מקציפים ביצים וסוכר.',
      'מוסיפים את תערובת השוקולד אל מקצפת הביצים והסוכר בקיפול, ולאחר מכן מוסיפים בקיפול את הקמח.',
      'לבסוף, מוסיפים את הליקר והוניל.',
      "שמים את התערובת שעה במקרר לפחות, להתייצבות התערובת, ולאחר מכן מחלקים למנג'טים קטנים (או לתבנית שקעים פצפונים), 170-180 מעלות בתנור, בסביבות 10-15 דקות.",
      'נא להשגיח.'
    ]
  },
  {
    title: `פוקצ'ה`,
    ingredients: [
      {
        title: 'חומרים לבצק',
        ingredients: [
          '5 כוסות קמח',
          '50 גרם שמרים טריים (גרגרים)',
          '1 1/4 כפית מלח',
          '1 1/4 כפית סוכר',
          '2 1/2 כפות עשבי תיבול קצוצים',
          '5 כפות שמן זית',
          '1 1/2 מים פושרים'
        ]
      }
    ],
    steps: [
      'שמים בקערה את הקמח (המנופה) עם המלח והסוכר ומערבבים.',
      'מוסיפים את כל החומרים חוץ מהמים, ומערבבים. יוצקים את המים בהדרגה עד לקבלת בצק אחיד. לשים את הבצק בין 5-7 דקות (בידיים!).',
      'מתפיחים במקום חמים כשעה, לשים שוב.',
      "מתפיחים שנית במשך כשעה, ולאחר מכן אפשר לרדד מעט, ויוצרים את הצורה הרצויה (אפשר לעשות אליפסות ארוכות, אפשר לעשות עיגולים קטנים, אפשר גם פוק'צה אחת עצומה).",
      'מעבירים לתבנית מקומחת. מורחים שמן זית על הבצק ומפזרים מעט מלח גס. מתפיחים חצי שעה נוספת.',
      "עכשיו אפשר לשים מעל מה שבא לנו - פרוסות עגבניה, חציל, פלפל, בצל (מטוגן או לא), זיתים... שמים בתנור על 200 מעלות עד הזהבה (משהו כמו 20 דקות). רצוי להגיש עם מטבלים שונים (שמנת, פסטו, זיתים וכו'...)."
    ],
    notes: '- יאמי -'
  },
  {
    title: `ריק`,
    description: ``,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: []
      }
    ],
    steps: []
  }
]

export default recipes
